betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
    *** Interrupt mode IO MEM operation ***
    =======================================
    [..]
      (+) Write an amount of data in non-blocking mode with Interrupt to a specific memory address using
          DAL_I2C_Mem_Write_IT()
      (+) At Memory end of write transfer, DAL_I2C_MemTxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_MemTxCpltCallback()
      (+) Read an amount of data in non-blocking mode with Interrupt from a specific memory address using
          DAL_I2C_Mem_Read_IT()
      (+) At Memory end of read transfer, DAL_I2C_MemRxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_MemRxCpltCallback()
      (+) In case of transfer Error, DAL_I2C_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_I2C_ErrorCallback()

    *** DMA mode IO operation ***
    ==============================
    [..]
      (+) Transmit in master mode an amount of data in non-blocking mode (DMA) using
          DAL_I2C_Master_Transmit_DMA()
      (+) At transmission end of transfer, DAL_I2C_MasterTxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_MasterTxCpltCallback()
      (+) Receive in master mode an amount of data in non-blocking mode (DMA) using
          DAL_I2C_Master_Receive_DMA()
      (+) At reception end of transfer, DAL_I2C_MasterRxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_MasterRxCpltCallback()
      (+) Transmit in slave mode an amount of data in non-blocking mode (DMA) using
          DAL_I2C_Slave_Transmit_DMA()
      (+) At transmission end of transfer, DAL_I2C_SlaveTxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_SlaveTxCpltCallback()
      (+) Receive in slave mode an amount of data in non-blocking mode (DMA) using
          DAL_I2C_Slave_Receive_DMA()
      (+) At reception end of transfer, DAL_I2C_SlaveRxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_SlaveRxCpltCallback()
      (+) In case of transfer Error, DAL_I2C_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_I2C_ErrorCallback()
      (+) Abort a master I2C process communication with Interrupt using DAL_I2C_Master_Abort_IT()
      (+) End of abort process, DAL_I2C_AbortCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_AbortCpltCallback()

    *** DMA mode IO MEM operation ***
    =================================
    [..]
      (+) Write an amount of data in non-blocking mode with DMA to a specific memory address using
          DAL_I2C_Mem_Write_DMA()
      (+) At Memory end of write transfer, DAL_I2C_MemTxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_MemTxCpltCallback()
      (+) Read an amount of data in non-blocking mode with DMA from a specific memory address using
          DAL_I2C_Mem_Read_DMA()
      (+) At Memory end of read transfer, DAL_I2C_MemRxCpltCallback() is executed and user can
           add his own code by customization of function pointer DAL_I2C_MemRxCpltCallback()
      (+) In case of transfer Error, DAL_I2C_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_I2C_ErrorCallback()


     *** I2C DAL driver macros list ***
     ==================================
     [..]
       Below the list of most used macros in I2C DAL driver.

      (+) __DAL_I2C_ENABLE:     Enable the I2C peripheral
      (+) __DAL_I2C_DISABLE:    Disable the I2C peripheral
      (+) __DAL_I2C_GET_FLAG:   Checks whether the specified I2C flag is set or not
      (+) __DAL_I2C_CLEAR_FLAG: Clear the specified I2C pending flag
      (+) __DAL_I2C_ENABLE_IT:  Enable the specified I2C interrupt
      (+) __DAL_I2C_DISABLE_IT: Disable the specified I2C interrupt

     *** Callback registration ***
     =============================================
    [..]
     The compilation flag USE_DAL_I2C_REGISTER_CALLBACKS when set to 1
     allows the user to configure dynamically the driver callbacks.
     Use Functions DAL_I2C_RegisterCallback() or DAL_I2C_RegisterAddrCallback()
     to register an interrupt callback.
    [..]
     Function DAL_I2C_RegisterCallback() allows to register following callbacks:
       (+) MasterTxCpltCallback : callback for Master transmission end of transfer.
       (+) MasterRxCpltCallback : callback for Master reception end of transfer.
       (+) SlaveTxCpltCallback  : callback for Slave transmission end of transfer.
       (+) SlaveRxCpltCallback  : callback for Slave reception end of transfer.
       (+) ListenCpltCallback   : callback for end of listen mode.
       (+) MemTxCpltCallback    : callback for Memory transmission end of transfer.
       (+) MemRxCpltCallback    : callback for Memory reception end of transfer.
       (+) ErrorCallback        : callback for error detection.
       (+) AbortCpltCallback    : callback for abort completion process.
       (+) MspInitCallback      : callback for Msp Init.
       (+) MspDeInitCallback    : callback for Msp DeInit.
     This function takes as parameters the DAL peripheral handle, the Callback ID
     and a pointer to the user callback function.
    [..]
     For specific callback AddrCallback use dedicated register callbacks : DAL_I2C_RegisterAddrCallback().
    [..]
     Use function DAL_I2C_UnRegisterCallback to reset a callback to the default
     weak function.
     DAL_I2C_UnRegisterCallback takes as parameters the DAL peripheral handle,
     and the Callback ID.
     This function allows to reset following callbacks:
       (+) MasterTxCpltCallback : callback for Master transmission end of transfer.
       (+) MasterRxCpltCallback : callback for Master reception end of transfer.
       (+) SlaveTxCpltCallback  : callback for Slave transmission end of transfer.
       (+) SlaveRxCpltCallback  : callback for Slave reception end of transfer.
       (+) ListenCpltCallback   : callback for end of listen mode.
       (+) MemTxCpltCallback    : callback for Memory transmission end of transfer.
       (+) MemRxCpltCallback    : callback for Memory reception end of transfer.
       (+) ErrorCallback        : callback for error detection.
       (+) AbortCpltCallback    : callback for abort completion process.
       (+) MspInitCallback      : callback for Msp Init.
       (+) MspDeInitCallback    : callback for Msp DeInit.
    [..]
     For callback AddrCallback use dedicated register callbacks : DAL_I2C_UnRegisterAddrCallback().
    [..]
     By default, after the DAL_I2C_Init() and when the state is DAL_I2C_STATE_RESET
     all callbacks are set to the corresponding weak functions:
     examples DAL_I2C_MasterTxCpltCallback(), DAL_I2C_MasterRxCpltCallback().
     Exception done for MspInit and MspDeInit functions that are
     reset to the legacy weak functions in the DAL_I2C_Init()/ DAL_I2C_DeInit() only when
     these callbacks are null (not registered beforehand).
     If MspInit or MspDeInit are not null, the DAL_I2C_Init()/ DAL_I2C_DeInit()
     keep and use the user MspInit/MspDeInit callbacks (registered beforehand) whatever the state.
    [..]
     Callbacks can be registered/unregistered in DAL_I2C_STATE_READY state only.
     Exception done MspInit/MspDeInit functions that can be registered/unregistered
     in DAL_I2C_STATE_READY or DAL_I2C_STATE_RESET state,
     thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
     Then, the user first registers the MspInit/MspDeInit user callbacks
     using DAL_I2C_RegisterCallback() before calling DAL_I2C_DeInit()
     or DAL_I2C_Init() function.
    [..]
     When the compilation flag USE_DAL_I2C_REGISTER_CALLBACKS is set to 0 or
     not defined, the callback registration feature is not available and all callbacks
     are set to the corresponding weak functions.



