betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */

/**
  * @brief  I2C data register flush process.
  * @param  hi2c I2C handle.
  * @retval None
  */
static void I2C_Flush_DATA(I2C_HandleTypeDef *hi2c)
{
  /* Write a dummy data in DR to clear TXE flag */
  if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE) != RESET)
  {
    hi2c->Instance->DATA = 0x00U;
  }
}

/**
  * @}
  */

/** @defgroup I2C_Exported_Functions_Group2 Input and Output operation functions
 *  @brief   Data transfers functions
 *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the I2C data
    transfers.

    (#) There are two modes of transfer:
       (++) Blocking mode : The communication is performed in the polling mode.
            The status of all data processing is returned by the same function
            after finishing transfer.
       (++) No-Blocking mode : The communication is performed using Interrupts
            or DMA. These functions return the status of the transfer startup.
            The end of the data processing will be indicated through the
            dedicated I2C IRQ when using Interrupt mode or the DMA IRQ when
            using DMA mode.

    (#) Blocking mode functions are :
        (++) DAL_I2C_Master_Transmit()
        (++) DAL_I2C_Master_Receive()
        (++) DAL_I2C_Slave_Transmit()
        (++) DAL_I2C_Slave_Receive()
        (++) DAL_I2C_Mem_Write()
        (++) DAL_I2C_Mem_Read()
        (++) DAL_I2C_IsDeviceReady()

    (#) No-Blocking mode functions with Interrupt are :
        (++) DAL_I2C_Master_Transmit_IT()
        (++) DAL_I2C_Master_Receive_IT()
        (++) DAL_I2C_Slave_Transmit_IT()
        (++) DAL_I2C_Slave_Receive_IT()
        (++) DAL_I2C_Mem_Write_IT()
        (++) DAL_I2C_Mem_Read_IT()
        (++) DAL_I2C_Master_Seq_Transmit_IT()
        (++) DAL_I2C_Master_Seq_Receive_IT()
        (++) DAL_I2C_Slave_Seq_Transmit_IT()
        (++) DAL_I2C_Slave_Seq_Receive_IT()
        (++) DAL_I2C_EnableListen_IT()
        (++) DAL_I2C_DisableListen_IT()
        (++) DAL_I2C_Master_Abort_IT()

    (#) No-Blocking mode functions with DMA are :
        (++) DAL_I2C_Master_Transmit_DMA()
        (++) DAL_I2C_Master_Receive_DMA()
        (++) DAL_I2C_Slave_Transmit_DMA()
        (++) DAL_I2C_Slave_Receive_DMA()
        (++) DAL_I2C_Mem_Write_DMA()
        (++) DAL_I2C_Mem_Read_DMA()
        (++) DAL_I2C_Master_Seq_Transmit_DMA()
        (++) DAL_I2C_Master_Seq_Receive_DMA()
        (++) DAL_I2C_Slave_Seq_Transmit_DMA()
        (++) DAL_I2C_Slave_Seq_Receive_DMA()

    (#) A set of Transfer Complete Callbacks are provided in non Blocking mode:
        (++) DAL_I2C_MasterTxCpltCallback()
        (++) DAL_I2C_MasterRxCpltCallback()
        (++) DAL_I2C_SlaveTxCpltCallback()
        (++) DAL_I2C_SlaveRxCpltCallback()
        (++) DAL_I2C_MemTxCpltCallback()
        (++) DAL_I2C_MemRxCpltCallback()
        (++) DAL_I2C_AddrCallback()
        (++) DAL_I2C_ListenCpltCallback()
        (++) DAL_I2C_ErrorCallback()
        (++) DAL_I2C_AbortCpltCallback()

@endverbatim
  * @{
  */

/**
  * @brief  Transmits in master mode an amount of data in blocking mode.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @param  Timeout Timeout duration
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2C_Master_Transmit(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
  /* Init tickstart for timeout management*/
  uint32_t tickstart = DAL_GetTick();

  if (hi2c->State == DAL_I2C_STATE_READY)
  {
    /* Wait until BUSY flag is reset */
    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != DAL_OK)
    {
      return DAL_BUSY;
    }

    /* Process Locked */
    __DAL_LOCK(hi2c);

    /* Check if the I2C is already enabled */
    if ((hi2c->Instance->CTRL1 & I2C_CTRL1_I2CEN) != I2C_CTRL1_I2CEN)
    {
      /* Enable I2C peripheral */
      __DAL_I2C_ENABLE(hi2c);
    }

    /* Disable Pos */
    CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKPOS);

    hi2c->State       = DAL_I2C_STATE_BUSY_TX;
    hi2c->Mode        = DAL_I2C_MODE_MASTER;
    hi2c->ErrorCode   = DAL_I2C_ERROR_NONE;

    /* Prepare transfer parameters */
    hi2c->pBuffPtr    = pData;
    hi2c->XferCount   = Size;
    hi2c->XferSize    = hi2c->XferCount;
    hi2c->XferOptions = I2C_NO_OPTION_FRAME;

    /* Send Slave Address */
    if (I2C_MasterRequestWrite(hi2c, DevAddress, Timeout, tickstart) != DAL_OK)
    {
      return DAL_ERROR;
    }

    /* Clear ADDR flag */
    __DAL_I2C_CLEAR_ADDRFLAG(hi2c);

    while (hi2c->XferSize > 0U)
    {
      /* Wait until TXE flag is set */
      if (I2C_WaitOnTXEFlagUntilTimeout(hi2c, Timeout, tickstart) != DAL_OK)
      {
        if (hi2c->ErrorCode == DAL_I2C_ERROR_AF)
        {
          /* Generate Stop */
          SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);
        }
        return DAL_ERROR;
      }

      /* Write data to DATA */
      hi2c->Instance->DATA = *hi2c->pBuffPtr;

      /* Increment Buffer pointer */
      hi2c->pBuffPtr++;

      /* Update counter */
      hi2c->XferCount--;
      hi2c->XferSize--;

      if ((__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET) && (hi2c->XferSize != 0U))
      {
        /* Write data to DATA */
        hi2c->Instance->DATA = *hi2c->pBuffPtr;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferCount--;
        hi2c->XferSize--;
      }

