betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
    /* Check if the I2C is already enabled */
    if ((hi2c->Instance->CTRL1 & I2C_CTRL1_I2CEN) != I2C_CTRL1_I2CEN)
    {
      /* Enable I2C peripheral */
      __DAL_I2C_ENABLE(hi2c);
    }

    /* Disable Pos */
    CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKPOS);

    hi2c->State     = DAL_I2C_STATE_BUSY_TX;
    hi2c->Mode      = DAL_I2C_MODE_SLAVE;
    hi2c->ErrorCode = DAL_I2C_ERROR_NONE;

    /* Prepare transfer parameters */
    hi2c->pBuffPtr    = pData;
    hi2c->XferCount   = Size;
    hi2c->XferSize    = hi2c->XferCount;
    hi2c->XferOptions = I2C_NO_OPTION_FRAME;

    if (hi2c->hdmatx != NULL)
    {
      /* Set the I2C DMA transfer complete callback */
      hi2c->hdmatx->XferCpltCallback = I2C_DMAXferCplt;

      /* Set the DMA error callback */
      hi2c->hdmatx->XferErrorCallback = I2C_DMAError;

      /* Set the unused DMA callbacks to NULL */
      hi2c->hdmatx->XferHalfCpltCallback = NULL;
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
      hi2c->hdmatx->XferM1CpltCallback = NULL;
      hi2c->hdmatx->XferM1HalfCpltCallback = NULL;
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
      hi2c->hdmatx->XferAbortCallback = NULL;

      /* Enable the DMA stream */
      dmaxferstatus = DAL_DMA_Start_IT(hi2c->hdmatx, (uint32_t)hi2c->pBuffPtr, (uint32_t)&hi2c->Instance->DATA, hi2c->XferSize);
    }
    else
    {
      /* Update I2C state */
      hi2c->State     = DAL_I2C_STATE_LISTEN;
      hi2c->Mode      = DAL_I2C_MODE_NONE;

      /* Update I2C error code */
      hi2c->ErrorCode |= DAL_I2C_ERROR_DMA_PARAM;

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);

      return DAL_ERROR;
    }

    if (dmaxferstatus == DAL_OK)
    {
      /* Enable Address Acknowledge */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);

      /* Note : The I2C interrupts must be enabled after unlocking current process
      to avoid the risk of I2C interrupt handle execution before current
      process unlock */
      /* Enable EVT and ERR interrupt */
      __DAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

      /* Enable DMA Request */
      hi2c->Instance->CTRL2 |= I2C_CTRL2_DMAEN;

      return DAL_OK;
    }
    else
    {
      /* Update I2C state */
      hi2c->State     = DAL_I2C_STATE_READY;
      hi2c->Mode      = DAL_I2C_MODE_NONE;

      /* Update I2C error code */
      hi2c->ErrorCode |= DAL_I2C_ERROR_DMA;

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);

      return DAL_ERROR;
    }
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Receive in slave mode an amount of data in non-blocking mode with DMA
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2C_Slave_Receive_DMA(I2C_HandleTypeDef *hi2c, uint8_t *pData, uint16_t Size)
{
  DAL_StatusTypeDef dmaxferstatus;

  if (hi2c->State == DAL_I2C_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  DAL_ERROR;
    }

    /* Process Locked */
    __DAL_LOCK(hi2c);

    /* Check if the I2C is already enabled */
    if ((hi2c->Instance->CTRL1 & I2C_CTRL1_I2CEN) != I2C_CTRL1_I2CEN)
    {
      /* Enable I2C peripheral */
      __DAL_I2C_ENABLE(hi2c);
    }

    /* Disable Pos */
    CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKPOS);

    hi2c->State     = DAL_I2C_STATE_BUSY_RX;
    hi2c->Mode      = DAL_I2C_MODE_SLAVE;
    hi2c->ErrorCode = DAL_I2C_ERROR_NONE;

    /* Prepare transfer parameters */
    hi2c->pBuffPtr    = pData;
    hi2c->XferCount   = Size;
    hi2c->XferSize    = hi2c->XferCount;
    hi2c->XferOptions = I2C_NO_OPTION_FRAME;

    if (hi2c->hdmarx != NULL)
    {
      /* Set the I2C DMA transfer complete callback */
      hi2c->hdmarx->XferCpltCallback = I2C_DMAXferCplt;

      /* Set the DMA error callback */
      hi2c->hdmarx->XferErrorCallback = I2C_DMAError;

      /* Set the unused DMA callbacks to NULL */
      hi2c->hdmarx->XferHalfCpltCallback = NULL;
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
      hi2c->hdmarx->XferM1CpltCallback = NULL;
      hi2c->hdmarx->XferM1HalfCpltCallback = NULL;
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
      hi2c->hdmarx->XferAbortCallback = NULL;

      /* Enable the DMA stream */
      dmaxferstatus = DAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t)&hi2c->Instance->DATA, (uint32_t)hi2c->pBuffPtr, hi2c->XferSize);
    }
    else
    {
      /* Update I2C state */
      hi2c->State     = DAL_I2C_STATE_LISTEN;
      hi2c->Mode      = DAL_I2C_MODE_NONE;

      /* Update I2C error code */
      hi2c->ErrorCode |= DAL_I2C_ERROR_DMA_PARAM;

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);

      return DAL_ERROR;
    }

    if (dmaxferstatus == DAL_OK)
    {
      /* Enable Address Acknowledge */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);

      /* Note : The I2C interrupts must be enabled after unlocking current process
      to avoid the risk of I2C interrupt handle execution before current
      process unlock */
      /* Enable EVT and ERR interrupt */
      __DAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

      /* Enable DMA Request */
      SET_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_DMAEN);

      return DAL_OK;
    }
    else
    {
      /* Update I2C state */
      hi2c->State     = DAL_I2C_STATE_READY;
      hi2c->Mode      = DAL_I2C_MODE_NONE;

