betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
      /* Clear ADDR flag */
      __DAL_I2C_CLEAR_ADDRFLAG(hi2c);

      /* Generate Stop */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);
    }
    else if (hi2c->XferSize == 2U)
    {
      /* Disable Acknowledge */
      CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

      /* Enable Pos */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKPOS);

      /* Clear ADDR flag */
      __DAL_I2C_CLEAR_ADDRFLAG(hi2c);
    }
    else
    {
      /* Clear ADDR flag */
      __DAL_I2C_CLEAR_ADDRFLAG(hi2c);
    }

    while (hi2c->XferSize > 0U)
    {
      if (hi2c->XferSize <= 3U)
      {
        /* One byte */
        if (hi2c->XferSize == 1U)
        {
          /* Wait until RXNE flag is set */
          if (I2C_WaitOnRXNEFlagUntilTimeout(hi2c, Timeout, tickstart) != DAL_OK)
          {
            return DAL_ERROR;
          }

          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;
        }
        /* Two bytes */
        else if (hi2c->XferSize == 2U)
        {
          /* Wait until BTF flag is set */
          if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, Timeout, tickstart) != DAL_OK)
          {
            return DAL_ERROR;
          }

          /* Generate Stop */
          SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);

          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;

          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;
        }
        /* 3 Last bytes */
        else
        {
          /* Wait until BTF flag is set */
          if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, Timeout, tickstart) != DAL_OK)
          {
            return DAL_ERROR;
          }

          /* Disable Acknowledge */
          CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;

          /* Wait until BTF flag is set */
          if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, Timeout, tickstart) != DAL_OK)
          {
            return DAL_ERROR;
          }

          /* Generate Stop */
          SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);

          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;

          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;
        }
      }
      else
      {
        /* Wait until RXNE flag is set */
        if (I2C_WaitOnRXNEFlagUntilTimeout(hi2c, Timeout, tickstart) != DAL_OK)
        {
          return DAL_ERROR;
        }

        /* Read data from DATA */
        *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

        /* Increment Buffer pointer */
        hi2c->pBuffPtr++;

        /* Update counter */
        hi2c->XferSize--;
        hi2c->XferCount--;

        if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET)
        {
          if (hi2c->XferSize == 3U)
          {
            /* Disable Acknowledge */
            CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);
          }
          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;

          /* Update counter */
          hi2c->XferSize--;
          hi2c->XferCount--;
        }
      }
    }

    hi2c->State = DAL_I2C_STATE_READY;
    hi2c->Mode = DAL_I2C_MODE_NONE;

    /* Process Unlocked */
    __DAL_UNLOCK(hi2c);

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Write an amount of data in non-blocking mode with Interrupt to a specific memory address
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  MemAddress Internal memory address
  * @param  MemAddSize Size of internal memory address
  * @param  pData Pointer to data buffer
  * @param  Size Amount of data to be sent
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2C_Mem_Write_IT(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size)
{
  __IO uint32_t count = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_I2C_MEMADD_SIZE(MemAddSize));

  if (hi2c->State == DAL_I2C_STATE_READY)
  {
    /* Wait until BUSY flag is reset */
    count = I2C_TIMEOUT_BUSY_FLAG * (SystemCoreClock / 25U / 1000U);
    do
    {
      count--;
      if (count == 0U)
      {
        hi2c->PreviousState       = I2C_STATE_NONE;
        hi2c->State               = DAL_I2C_STATE_READY;
        hi2c->Mode                = DAL_I2C_MODE_NONE;
        hi2c->ErrorCode           |= DAL_I2C_ERROR_TIMEOUT;

        return DAL_BUSY;
      }
    }
    while (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) != RESET);

    /* Process Locked */
    __DAL_LOCK(hi2c);

