betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
        /* Update I2C error code */
        hi2c->ErrorCode |= DAL_I2C_ERROR_DMA_PARAM;

        /* Process Unlocked */
        __DAL_UNLOCK(hi2c);

        return DAL_ERROR;
      }

      if (dmaxferstatus == DAL_OK)
      {
        /* Send Slave Address and Memory Address */
        if (I2C_RequestMemoryRead(hi2c, DevAddress, MemAddress, MemAddSize, I2C_TIMEOUT_FLAG, tickstart) != DAL_OK)
        {
          /* Abort the ongoing DMA */
          dmaxferstatus = DAL_DMA_Abort_IT(hi2c->hdmarx);

          /* Prevent unused argument(s) compilation and MISRA warning */
          UNUSED(dmaxferstatus);

          /* Set the unused I2C DMA transfer complete callback to NULL */
          hi2c->hdmarx->XferCpltCallback = NULL;

          /* Disable Acknowledge */
          CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

          hi2c->XferSize = 0U;
          hi2c->XferCount = 0U;

          /* Disable I2C peripheral to prevent dummy data in buffer */
          __DAL_I2C_DISABLE(hi2c);

          return DAL_ERROR;
        }

        if (hi2c->XferSize == 1U)
        {
          /* Disable Acknowledge */
          CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);
        }
        else
        {
          /* Enable Last DMA bit */
          SET_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_LTCFG);
        }

        /* Clear ADDR flag */
        __DAL_I2C_CLEAR_ADDRFLAG(hi2c);

        /* Process Unlocked */
        __DAL_UNLOCK(hi2c);

        /* Note : The I2C interrupts must be enabled after unlocking current process
        to avoid the risk of I2C interrupt handle execution before current
        process unlock */
        /* Enable ERR interrupt */
        __DAL_I2C_ENABLE_IT(hi2c, I2C_IT_ERR);

        /* Enable DMA Request */
        hi2c->Instance->CTRL2 |= I2C_CTRL2_DMAEN;
      }
      else
      {
        /* Update I2C state */
        hi2c->State     = DAL_I2C_STATE_READY;
        hi2c->Mode      = DAL_I2C_MODE_NONE;

        /* Update I2C error code */
        hi2c->ErrorCode |= DAL_I2C_ERROR_DMA;

        /* Process Unlocked */
        __DAL_UNLOCK(hi2c);

        return DAL_ERROR;
      }
    }
    else
    {
      /* Send Slave Address and Memory Address */
      if (I2C_RequestMemoryRead(hi2c, DevAddress, MemAddress, MemAddSize, I2C_TIMEOUT_FLAG, tickstart) != DAL_OK)
      {
        return DAL_ERROR;
      }

      /* Clear ADDR flag */
      __DAL_I2C_CLEAR_ADDRFLAG(hi2c);

      /* Generate Stop */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);

      hi2c->State = DAL_I2C_STATE_READY;

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);
    }

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Checks if target device is ready for communication.
  * @note   This function is used with Memory devices
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  Trials Number of trials
  * @param  Timeout Timeout duration
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2C_IsDeviceReady(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint32_t Trials, uint32_t Timeout)
{
  /* Get tick */
  uint32_t tickstart = DAL_GetTick();
  uint32_t I2C_Trials = 0U;
  FlagStatus tmp1;
  FlagStatus tmp2;

  if (hi2c->State == DAL_I2C_STATE_READY)
  {
    /* Wait until BUSY flag is reset */
    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != DAL_OK)
    {
      return DAL_BUSY;
    }

    /* Process Locked */
    __DAL_LOCK(hi2c);

    /* Check if the I2C is already enabled */
    if ((hi2c->Instance->CTRL1 & I2C_CTRL1_I2CEN) != I2C_CTRL1_I2CEN)
    {
      /* Enable I2C peripheral */
      __DAL_I2C_ENABLE(hi2c);
    }

    /* Disable Pos */
    CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKPOS);

    hi2c->State = DAL_I2C_STATE_BUSY;
    hi2c->ErrorCode = DAL_I2C_ERROR_NONE;
    hi2c->XferOptions = I2C_NO_OPTION_FRAME;

    do
    {
      /* Generate Start */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START);

      /* Wait until SB flag is set */
      if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout, tickstart) != DAL_OK)
      {
        if (READ_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START) == I2C_CTRL1_START)
        {
          hi2c->ErrorCode = DAL_I2C_WRONG_START;
        }
        return DAL_TIMEOUT;
      }

      /* Send slave address */
      hi2c->Instance->DATA = I2C_7BIT_ADD_WRITE(DevAddress);

      /* Wait until ADDR or AF flag are set */
      /* Get tick */
      tickstart = DAL_GetTick();

      tmp1 = __DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR);
      tmp2 = __DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF);
      while ((hi2c->State != DAL_I2C_STATE_TIMEOUT) && (tmp1 == RESET) && (tmp2 == RESET))
      {
        if (((DAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          hi2c->State = DAL_I2C_STATE_TIMEOUT;
        }
        tmp1 = __DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR);
        tmp2 = __DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF);
      }

      hi2c->State = DAL_I2C_STATE_READY;

      /* Check if the ADDR flag has been set */
      if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR) == SET)
      {
        /* Generate Stop */
        SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);

        /* Clear ADDR Flag */
        __DAL_I2C_CLEAR_ADDRFLAG(hi2c);

        /* Wait until BUSY flag is reset */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != DAL_OK)
        {
          return DAL_ERROR;
        }

        hi2c->State = DAL_I2C_STATE_READY;

        /* Process Unlocked */
        __DAL_UNLOCK(hi2c);

        return DAL_OK;
      }
      else
      {
        /* Generate Stop */
        SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);

        /* Clear AF Flag */
        __DAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

        /* Wait until BUSY flag is reset */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY_FLAG, tickstart) != DAL_OK)
        {
          return DAL_ERROR;
        }
      }

      /* Increment Trials */
      I2C_Trials++;
    }
    while (I2C_Trials < Trials);

