betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
    /* Clear TXE flag */
    I2C_Flush_DATA(hi2c);

#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->SlaveTxCpltCallback(hi2c);
#else
    DAL_I2C_SlaveTxCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }
  else
  {
    /* Clear AF flag only */
    /* State Listen, but XferOptions == FIRST or NEXT */
    __DAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);
  }
}

/**
  * @brief  I2C interrupts error process
  * @param  hi2c I2C handle.
  * @retval None
  */
static void I2C_ITError(I2C_HandleTypeDef *hi2c)
{
  /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
  DAL_I2C_StateTypeDef CurrentState = hi2c->State;
  DAL_I2C_ModeTypeDef CurrentMode = hi2c->Mode;
  uint32_t CurrentError;

  if (((CurrentMode == DAL_I2C_MODE_MASTER) || (CurrentMode == DAL_I2C_MODE_MEM)) && (CurrentState == DAL_I2C_STATE_BUSY_RX))
  {
    /* Disable Pos bit in I2C CR1 when error occurred in Master/Mem Receive IT Process */
    hi2c->Instance->CTRL1 &= ~I2C_CTRL1_ACKPOS;
  }

  if (((uint32_t)CurrentState & (uint32_t)DAL_I2C_STATE_LISTEN) == (uint32_t)DAL_I2C_STATE_LISTEN)
  {
    /* keep DAL_I2C_STATE_LISTEN */
    hi2c->PreviousState = I2C_STATE_NONE;
    hi2c->State = DAL_I2C_STATE_LISTEN;
  }
  else
  {
    /* If state is an abort treatment on going, don't change state */
    /* This change will be do later */
    if ((READ_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_DMAEN) != I2C_CTRL2_DMAEN) && (CurrentState != DAL_I2C_STATE_ABORT))
    {
      hi2c->State = DAL_I2C_STATE_READY;
      hi2c->Mode = DAL_I2C_MODE_NONE;
    }
    hi2c->PreviousState = I2C_STATE_NONE;
  }

  /* Abort DMA transfer */
  if (READ_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_DMAEN) == I2C_CTRL2_DMAEN)
  {
    hi2c->Instance->CTRL2 &= ~I2C_CTRL2_DMAEN;

    if (hi2c->hdmatx->State != DAL_DMA_STATE_READY)
    {
      /* Set the DMA Abort callback :
      will lead to call DAL_I2C_ErrorCallback() at end of DMA abort procedure */
      hi2c->hdmatx->XferAbortCallback = I2C_DMAAbort;

      if (DAL_DMA_Abort_IT(hi2c->hdmatx) != DAL_OK)
      {
        /* Disable I2C peripheral to prevent dummy data in buffer */
        __DAL_I2C_DISABLE(hi2c);

        hi2c->State = DAL_I2C_STATE_READY;

        /* Call Directly XferAbortCallback function in case of error */
        hi2c->hdmatx->XferAbortCallback(hi2c->hdmatx);
      }
    }
    else
    {
      /* Set the DMA Abort callback :
      will lead to call DAL_I2C_ErrorCallback() at end of DMA abort procedure */
      hi2c->hdmarx->XferAbortCallback = I2C_DMAAbort;

      if (DAL_DMA_Abort_IT(hi2c->hdmarx) != DAL_OK)
      {
        /* Store Last receive data if any */
        if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
        {
          /* Read data from DATA */
          *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

          /* Increment Buffer pointer */
          hi2c->pBuffPtr++;
        }

        /* Disable I2C peripheral to prevent dummy data in buffer */
        __DAL_I2C_DISABLE(hi2c);

        hi2c->State = DAL_I2C_STATE_READY;

        /* Call Directly hi2c->hdmarx->XferAbortCallback function in case of error */
        hi2c->hdmarx->XferAbortCallback(hi2c->hdmarx);
      }
    }
  }
  else if (hi2c->State == DAL_I2C_STATE_ABORT)
  {
    hi2c->State = DAL_I2C_STATE_READY;
    hi2c->ErrorCode = DAL_I2C_ERROR_NONE;

    /* Store Last receive data if any */
    if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
    {
      /* Read data from DATA */
      *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

      /* Increment Buffer pointer */
      hi2c->pBuffPtr++;
    }

    /* Disable I2C peripheral to prevent dummy data in buffer */
    __DAL_I2C_DISABLE(hi2c);

    /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->AbortCpltCallback(hi2c);
#else
    DAL_I2C_AbortCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }
  else
  {
    /* Store Last receive data if any */
    if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE) == SET)
    {
      /* Read data from DATA */
      *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->DATA;

      /* Increment Buffer pointer */
      hi2c->pBuffPtr++;
    }

    /* Call user error callback */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->ErrorCallback(hi2c);
#else
    DAL_I2C_ErrorCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }

  /* STOP Flag is not set after a NACK reception, BusError, ArbitrationLost, OverRun */
  CurrentError = hi2c->ErrorCode;

  if (((CurrentError & DAL_I2C_ERROR_BERR) == DAL_I2C_ERROR_BERR) || \
      ((CurrentError & DAL_I2C_ERROR_ARLO) == DAL_I2C_ERROR_ARLO) || \
      ((CurrentError & DAL_I2C_ERROR_AF) == DAL_I2C_ERROR_AF)     || \
      ((CurrentError & DAL_I2C_ERROR_OVR) == DAL_I2C_ERROR_OVR))
  {
    /* Disable EVT, BUF and ERR interrupt */
    __DAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);
  }

  /* So may inform upper layer that listen phase is stopped */
  /* during NACK error treatment */
  CurrentState = hi2c->State;
  if (((hi2c->ErrorCode & DAL_I2C_ERROR_AF) == DAL_I2C_ERROR_AF) && (CurrentState == DAL_I2C_STATE_LISTEN))
  {
    hi2c->XferOptions   = I2C_NO_OPTION_FRAME;
    hi2c->PreviousState = I2C_STATE_NONE;
    hi2c->State         = DAL_I2C_STATE_READY;
    hi2c->Mode          = DAL_I2C_MODE_NONE;

    /* Call the Listen Complete callback, to inform upper layer of the end of Listen usecase */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->ListenCpltCallback(hi2c);
#else
    DAL_I2C_ListenCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }
}

/**
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @param  DevAddress Target device address: The device 7 bits address value
  *         in datasheet must be shifted to the left before calling the interface
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval DAL status
  */
static DAL_StatusTypeDef I2C_MasterRequestWrite(I2C_HandleTypeDef *hi2c, uint16_t DevAddress, uint32_t Timeout, uint32_t Tickstart)
{
  /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
  uint32_t CurrentXferOptions = hi2c->XferOptions;

  /* Generate Start condition if first transfer */
  if ((CurrentXferOptions == I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_FIRST_FRAME) || (CurrentXferOptions == I2C_NO_OPTION_FRAME))
  {
    /* Generate Start */
    SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START);
  }
  else if (hi2c->PreviousState == I2C_STATE_MASTER_BUSY_RX)
  {
    /* Generate ReStart */
    SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START);
  }
  else
  {
    /* Do nothing */
  }

  /* Wait until SB flag is set */
  if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout, Tickstart) != DAL_OK)
  {
    if (READ_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START) == I2C_CTRL1_START)
    {
      hi2c->ErrorCode = DAL_I2C_WRONG_START;
    }
    return DAL_TIMEOUT;
  }

