betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
  /* Send slave address */
  hi2c->Instance->DATA = I2C_7BIT_ADD_WRITE(DevAddress);

  /* Wait until ADDR flag is set */
  if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout, Tickstart) != DAL_OK)
  {
    return DAL_ERROR;
  }

  /* Clear ADDR flag */
  __DAL_I2C_CLEAR_ADDRFLAG(hi2c);

  /* Wait until TXE flag is set */
  if (I2C_WaitOnTXEFlagUntilTimeout(hi2c, Timeout, Tickstart) != DAL_OK)
  {
    if (hi2c->ErrorCode == DAL_I2C_ERROR_AF)
    {
      /* Generate Stop */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);
    }
    return DAL_ERROR;
  }

  /* If Memory address size is 8Bit */
  if (MemAddSize == I2C_MEMADD_SIZE_8BIT)
  {
    /* Send Memory Address */
    hi2c->Instance->DATA = I2C_MEM_ADD_LSB(MemAddress);
  }
  /* If Memory address size is 16Bit */
  else
  {
    /* Send MSB of Memory Address */
    hi2c->Instance->DATA = I2C_MEM_ADD_MSB(MemAddress);

    /* Wait until TXE flag is set */
    if (I2C_WaitOnTXEFlagUntilTimeout(hi2c, Timeout, Tickstart) != DAL_OK)
    {
      if (hi2c->ErrorCode == DAL_I2C_ERROR_AF)
      {
        /* Generate Stop */
        SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);
      }
      return DAL_ERROR;
    }

    /* Send LSB of Memory Address */
    hi2c->Instance->DATA = I2C_MEM_ADD_LSB(MemAddress);
  }

  /* Wait until TXE flag is set */
  if (I2C_WaitOnTXEFlagUntilTimeout(hi2c, Timeout, Tickstart) != DAL_OK)
  {
    if (hi2c->ErrorCode == DAL_I2C_ERROR_AF)
    {
      /* Generate Stop */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);
    }
    return DAL_ERROR;
  }

  /* Generate Restart */
  SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START);

  /* Wait until SB flag is set */
  if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout, Tickstart) != DAL_OK)
  {
    if (READ_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_START) == I2C_CTRL1_START)
    {
      hi2c->ErrorCode = DAL_I2C_WRONG_START;
    }
    return DAL_TIMEOUT;
  }

  /* Send slave address */
  hi2c->Instance->DATA = I2C_7BIT_ADD_READ(DevAddress);

  /* Wait until ADDR flag is set */
  if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout, Tickstart) != DAL_OK)
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  DMA I2C process complete callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void I2C_DMAXferCplt(DMA_HandleTypeDef *hdma)
{
  I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

  /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
  DAL_I2C_StateTypeDef CurrentState = hi2c->State;
  DAL_I2C_ModeTypeDef CurrentMode   = hi2c->Mode;
  uint32_t CurrentXferOptions       = hi2c->XferOptions;

  /* Disable EVT and ERR interrupt */
  __DAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

  /* Clear Complete callback */
  if (hi2c->hdmatx != NULL)
  {
    hi2c->hdmatx->XferCpltCallback = NULL;
  }
  if (hi2c->hdmarx != NULL)
  {
    hi2c->hdmarx->XferCpltCallback = NULL;
  }

  if ((((uint32_t)CurrentState & (uint32_t)DAL_I2C_STATE_BUSY_TX) == (uint32_t)DAL_I2C_STATE_BUSY_TX) || ((((uint32_t)CurrentState & (uint32_t)DAL_I2C_STATE_BUSY_RX) == (uint32_t)DAL_I2C_STATE_BUSY_RX) && (CurrentMode == DAL_I2C_MODE_SLAVE)))
  {
    /* Disable DMA Request */
    CLEAR_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_DMAEN);

    hi2c->XferCount = 0U;

    if (CurrentState == DAL_I2C_STATE_BUSY_TX_LISTEN)
    {
      /* Set state at DAL_I2C_STATE_LISTEN */
      hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_TX;
      hi2c->State = DAL_I2C_STATE_LISTEN;

      /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->SlaveTxCpltCallback(hi2c);
#else
      DAL_I2C_SlaveTxCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
    }
    else if (CurrentState == DAL_I2C_STATE_BUSY_RX_LISTEN)
    {
      /* Set state at DAL_I2C_STATE_LISTEN */
      hi2c->PreviousState = I2C_STATE_SLAVE_BUSY_RX;
      hi2c->State = DAL_I2C_STATE_LISTEN;

      /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->SlaveRxCpltCallback(hi2c);
#else
      DAL_I2C_SlaveRxCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
      /* Do nothing */
    }

    /* Enable EVT and ERR interrupt to treat end of transfer in IRQ handler */
    __DAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);
  }
  /* Check current Mode, in case of treatment DMA handler have been preempted by a prior interrupt */
  else if (hi2c->Mode != DAL_I2C_MODE_NONE)
  {
    if (hi2c->XferCount == (uint16_t)1)
    {
      /* Disable Acknowledge */
      CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);
    }

    /* Disable EVT and ERR interrupt */
    __DAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

    /* Prepare next transfer or stop current transfer */
    if ((CurrentXferOptions == I2C_NO_OPTION_FRAME) || (CurrentXferOptions == I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_OTHER_AND_LAST_FRAME) || (CurrentXferOptions == I2C_LAST_FRAME))
    {
      /* Generate Stop */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);
    }

    /* Disable Last DMA */
    CLEAR_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_LTCFG);

    /* Disable DMA Request */
    CLEAR_BIT(hi2c->Instance->CTRL2, I2C_CTRL2_DMAEN);

    hi2c->XferCount = 0U;

    /* Check if Errors has been detected during transfer */
    if (hi2c->ErrorCode != DAL_I2C_ERROR_NONE)
    {
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
      hi2c->ErrorCallback(hi2c);
#else
      DAL_I2C_ErrorCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
    }
    else
    {
      hi2c->State = DAL_I2C_STATE_READY;

      if (hi2c->Mode == DAL_I2C_MODE_MEM)
      {
        hi2c->Mode = DAL_I2C_MODE_NONE;
        hi2c->PreviousState = I2C_STATE_NONE;

#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->MemRxCpltCallback(hi2c);
#else
        DAL_I2C_MemRxCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
      }
      else
      {
        hi2c->Mode = DAL_I2C_MODE_NONE;
        if ((CurrentXferOptions == I2C_FIRST_AND_LAST_FRAME) || (CurrentXferOptions == I2C_LAST_FRAME))
        {
          hi2c->PreviousState = I2C_STATE_NONE;
        }
        else
        {
          hi2c->PreviousState = I2C_STATE_MASTER_BUSY_RX;
        }

#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
        hi2c->MasterRxCpltCallback(hi2c);
#else
        DAL_I2C_MasterRxCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
      }
    }
  }
  else
  {
    /* Do nothing */
  }
}

/**
  * @brief  DMA I2C communication error callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void I2C_DMAError(DMA_HandleTypeDef *hdma)
{
  I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

  /* Clear Complete callback */
  if (hi2c->hdmatx != NULL)
  {
    hi2c->hdmatx->XferCpltCallback = NULL;
  }
  if (hi2c->hdmarx != NULL)
  {
    hi2c->hdmarx->XferCpltCallback = NULL;
  }

  /* Ignore DMA FIFO error */
  if (DAL_DMA_GetError(hdma) != DAL_DMA_ERROR_FE)
  {
    /* Disable Acknowledge */
    hi2c->Instance->CTRL1 &= ~I2C_CTRL1_ACKEN;

    hi2c->XferCount = 0U;

