betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2c.c
    hi2c->State = DAL_I2C_STATE_READY;
    hi2c->Mode = DAL_I2C_MODE_NONE;

    hi2c->ErrorCode |= DAL_I2C_ERROR_DMA;

#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->ErrorCallback(hi2c);
#else
    DAL_I2C_ErrorCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }
}

/**
  * @brief DMA I2C communication abort callback
  *        (To be called at end of DMA Abort procedure).
  * @param hdma DMA handle.
  * @retval None
  */
static void I2C_DMAAbort(DMA_HandleTypeDef *hdma)
{
  __IO uint32_t count = 0U;
  I2C_HandleTypeDef *hi2c = (I2C_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

  /* Declaration of temporary variable to prevent undefined behavior of volatile usage */
  DAL_I2C_StateTypeDef CurrentState = hi2c->State;

  /* During abort treatment, check that there is no pending STOP request */
  /* Wait until STOP flag is reset */
  count = I2C_TIMEOUT_FLAG * (SystemCoreClock / 25U / 1000U);
  do
  {
    if (count == 0U)
    {
      hi2c->ErrorCode |= DAL_I2C_ERROR_TIMEOUT;
      break;
    }
    count--;
  }
  while (READ_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP) == I2C_CTRL1_STOP);

  /* Clear Complete callback */
  if (hi2c->hdmatx != NULL)
  {
    hi2c->hdmatx->XferCpltCallback = NULL;
  }
  if (hi2c->hdmarx != NULL)
  {
    hi2c->hdmarx->XferCpltCallback = NULL;
  }

  /* Disable Acknowledge */
  CLEAR_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

  hi2c->XferCount = 0U;

  /* Reset XferAbortCallback */
  if (hi2c->hdmatx != NULL)
  {
    hi2c->hdmatx->XferAbortCallback = NULL;
  }
  if (hi2c->hdmarx != NULL)
  {
    hi2c->hdmarx->XferAbortCallback = NULL;
  }

  /* Disable I2C peripheral to prevent dummy data in buffer */
  __DAL_I2C_DISABLE(hi2c);

  /* Check if come from abort from user */
  if (hi2c->State == DAL_I2C_STATE_ABORT)
  {
    hi2c->State         = DAL_I2C_STATE_READY;
    hi2c->Mode          = DAL_I2C_MODE_NONE;
    hi2c->ErrorCode     = DAL_I2C_ERROR_NONE;

    /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->AbortCpltCallback(hi2c);
#else
    DAL_I2C_AbortCpltCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }
  else
  {
    if (((uint32_t)CurrentState & (uint32_t)DAL_I2C_STATE_LISTEN) == (uint32_t)DAL_I2C_STATE_LISTEN)
    {
      /* Renable I2C peripheral */
      __DAL_I2C_ENABLE(hi2c);

      /* Enable Acknowledge */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_ACKEN);

      /* keep DAL_I2C_STATE_LISTEN */
      hi2c->PreviousState = I2C_STATE_NONE;
      hi2c->State = DAL_I2C_STATE_LISTEN;
    }
    else
    {
      hi2c->State = DAL_I2C_STATE_READY;
      hi2c->Mode = DAL_I2C_MODE_NONE;
    }

    /* Call the corresponding callback to inform upper layer of End of Transfer */
#if (USE_DAL_I2C_REGISTER_CALLBACKS == 1)
    hi2c->ErrorCallback(hi2c);
#else
    DAL_I2C_ErrorCallback(hi2c);
#endif /* USE_DAL_I2C_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  This function handles I2C Communication Timeout.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @param  Flag specifies the I2C flag to check.
  * @param  Status The new Flag status (SET or RESET).
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval DAL status
  */
static DAL_StatusTypeDef I2C_WaitOnFlagUntilTimeout(I2C_HandleTypeDef *hi2c, uint32_t Flag, FlagStatus Status, uint32_t Timeout, uint32_t Tickstart)
{
  /* Wait until flag is set */
  while (__DAL_I2C_GET_FLAG(hi2c, Flag) == Status)
  {
    /* Check for the Timeout */
    if (Timeout != DAL_MAX_DELAY)
    {
      if (((DAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
      {
        if ((__DAL_I2C_GET_FLAG(hi2c, Flag) == Status))
        {
          hi2c->PreviousState     = I2C_STATE_NONE;
          hi2c->State             = DAL_I2C_STATE_READY;
          hi2c->Mode              = DAL_I2C_MODE_NONE;
          hi2c->ErrorCode         |= DAL_I2C_ERROR_TIMEOUT;

          /* Process Unlocked */
          __DAL_UNLOCK(hi2c);

          return DAL_ERROR;
        }
      }
    }
  }
  return DAL_OK;
}

/**
  * @brief  This function handles I2C Communication Timeout for Master addressing phase.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @param  Flag specifies the I2C flag to check.
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval DAL status
  */
static DAL_StatusTypeDef I2C_WaitOnMasterAddressFlagUntilTimeout(I2C_HandleTypeDef *hi2c, uint32_t Flag, uint32_t Timeout, uint32_t Tickstart)
{
  while (__DAL_I2C_GET_FLAG(hi2c, Flag) == RESET)
  {
    if (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) == SET)
    {
      /* Generate Stop */
      SET_BIT(hi2c->Instance->CTRL1, I2C_CTRL1_STOP);

      /* Clear AF Flag */
      __DAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

      hi2c->PreviousState       = I2C_STATE_NONE;
      hi2c->State               = DAL_I2C_STATE_READY;
      hi2c->Mode                = DAL_I2C_MODE_NONE;
      hi2c->ErrorCode           |= DAL_I2C_ERROR_AF;

      /* Process Unlocked */
      __DAL_UNLOCK(hi2c);

      return DAL_ERROR;
    }

    /* Check for the Timeout */
    if (Timeout != DAL_MAX_DELAY)
    {
      if (((DAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
      {
        if ((__DAL_I2C_GET_FLAG(hi2c, Flag) == RESET))
        {
          hi2c->PreviousState       = I2C_STATE_NONE;
          hi2c->State               = DAL_I2C_STATE_READY;
          hi2c->Mode                = DAL_I2C_MODE_NONE;
          hi2c->ErrorCode           |= DAL_I2C_ERROR_TIMEOUT;

          /* Process Unlocked */
          __DAL_UNLOCK(hi2c);

          return DAL_ERROR;
        }
      }
    }
  }
  return DAL_OK;
}

/**
  * @brief  This function handles I2C Communication Timeout for specific usage of TXE flag.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param  Timeout Timeout duration
  * @param  Tickstart Tick start value
  * @retval DAL status
  */
static DAL_StatusTypeDef I2C_WaitOnTXEFlagUntilTimeout(I2C_HandleTypeDef *hi2c, uint32_t Timeout, uint32_t Tickstart)
{
  while (__DAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE) == RESET)
  {
    /* Check if a NACK is detected */
    if (I2C_IsAcknowledgeFailed(hi2c) != DAL_OK)
    {
      return DAL_ERROR;
    }

